--1757. Перерабатываемые и нежирные продукты
https://leetcode.com/problems/recyclable-and-low-fat-products/description/
/*Напишите решение, чтобы найти идентификаторы продуктов с низким содержанием жира и пригодных для вторичной переработки.
Верните таблицу результатов в любом порядке.
Формат результата приведен в следующем примере.*/

/*+-------------+---------+
| Column Name | Type    |
+-------------+---------+
| product_id  | int     |
| low_fats    | enum    |
| recyclable  | enum    |
+-------------+---------+

Input: 
Products table:
+-------------+----------+------------+
| product_id  | low_fats | recyclable |
+-------------+----------+------------+
| 0           | Y        | N          |
| 1           | Y        | Y          |
| 2           | N        | Y          |
| 3           | Y        | Y          |
| 4           | N        | N          |
+-------------+----------+------------+
Output: 
+-------------+
| product_id  |
+-------------+
| 1           |
| 3           |
+-------------+
Explanation: Only products 1 and 3 are both low fat and recyclable.*/

Select product_id
FROM Products
WHERE low_fats = 'Y' AND recyclable = 'Y';
--------------------------------------------------------------------

--1741. Найдите общее время, потраченное каждым сотрудником
https://leetcode.com/problems/find-total-time-spent-by-each-employee/

/*Напишите решение для расчета общего времени в минутах, затрачиваемого каждым сотрудником на каждый день в офисе. 
Обратите внимание, что в течение одного дня сотрудник может входить и уходить более одного раза. Время, 
проведенное в офисе для одной записи, - out_time - in_time.
Input: 
Employees table:
+--------+------------+---------+----------+
| emp_id | event_day  | in_time | out_time |
+--------+------------+---------+----------+
| 1      | 2020-11-28 | 4       | 32       |
| 1      | 2020-11-28 | 55      | 200      |
| 1      | 2020-12-03 | 1       | 42       |
| 2      | 2020-11-28 | 3       | 33       |
| 2      | 2020-12-09 | 47      | 74       |
+--------+------------+---------+----------+
Output: 
+------------+--------+------------+
| day        | emp_id | total_time |
+------------+--------+------------+
| 2020-11-28 | 1      | 173        |
| 2020-11-28 | 2      | 30         |
| 2020-12-03 | 1      | 41         |
| 2020-12-09 | 2      | 27         |
+------------+--------+------------+
Explanation: */

SELECT
    event_day AS day,
    emp_id,
    SUM(out_time - in_time) AS total_time
FROM Employees
GROUP BY 
    emp_id,
    day;

------------------------------------------------------------------

--182. Дублирующие Электронные Письма
https://leetcode.com/problems/duplicate-emails/description/

/*Напишите решение, чтобы сообщить обо всех дубликатах электронных писем. Обратите внимание, что гарантировано, что поле электронной почты не является NULL.

Верните таблицу результатов в любом порядке.

Input: 
Person table:
+----+---------+
| id | email   |
+----+---------+
| 1  | a@b.com |
| 2  | c@d.com |
| 3  | a@b.com |
+----+---------+
Output: 
+---------+
| Email   |
+---------+
| a@b.com |
+---------+*/

SELECT email AS Email
FROM Person
GROUP BY email
HAVING COUNT(*) > 1;

---------------------------------------------------------------

--количества уникальных предметов, которые каждый учитель преподает в университете
https://leetcode.com/problems/number-of-unique-subjects-taught-by-each-teacher/

/*Напишите решение для расчета количества уникальных предметов, которые каждый учитель преподает в университете.
Верните таблицу результатов в любом порядке.

Teacher table:
+------------+------------+---------+
| teacher_id | subject_id | dept_id |
+------------+------------+---------+
| 1          | 2          | 3       |
| 1          | 2          | 4       |
| 1          | 3          | 3       |
| 2          | 1          | 1       |
| 2          | 2          | 1       |
| 2          | 3          | 1       |
| 2          | 4          | 1       |
+------------+------------+---------+
Output:  
+------------+-----+
| teacher_id | cnt |
+------------+-----+
| 1          | 2   |
| 2          | 4   |
+------------+-----+*/

SELECT
    teacher_id,
    COUNT(DISTINCT subject_id) AS cnt
FROM Teacher
GROUP BY
    teacher_id;

--------------------------------------------------------------

--1693. Ежедневные лидеры и партнеры
https://leetcode.com/problems/daily-leads-and-partners/


/*Для каждого date_id и make_name найдите количество различных lead_id и разных partner_id.

Верните таблицу результатов в любом порядке.

Input: 
DailySales table:
+-----------+-----------+---------+------------+
| date_id   | make_name | lead_id | partner_id |
+-----------+-----------+---------+------------+
| 2020-12-8 | toyota    | 0       | 1          |
| 2020-12-8 | toyota    | 1       | 0          |
| 2020-12-8 | toyota    | 1       | 2          |
| 2020-12-7 | toyota    | 0       | 2          |
| 2020-12-7 | toyota    | 0       | 1          |
| 2020-12-8 | honda     | 1       | 2          |
| 2020-12-8 | honda     | 2       | 1          |
| 2020-12-7 | honda     | 0       | 1          |
| 2020-12-7 | honda     | 1       | 2          |
| 2020-12-7 | honda     | 2       | 1          |
+-----------+-----------+---------+------------+
Output: 
+-----------+-----------+--------------+-----------------+
| date_id   | make_name | unique_leads | unique_partners |
+-----------+-----------+--------------+-----------------+
| 2020-12-8 | toyota    | 2            | 3               |
| 2020-12-7 | toyota    | 1            | 2               |
| 2020-12-8 | honda     | 2            | 2               |
| 2020-12-7 | honda     | 3            | 2               |
+-----------+-----------+--------------+-----------------+*/


SELECT
    date_id,
    make_name,
    COUNT(DISTINCT lead_id) AS unique_leads,
    COUNT(DISTINCT partner_id) AS unique_partners
FROM DailySales
GROUP BY
    date_id,
    make_name;

---------------------------------------------------------------------------